<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">

  <title><![CDATA[Gnirt's Blog]]></title>
  <link href="http://Gnirt.github.io/atom.xml" rel="self"/>
  <link href="http://Gnirt.github.io/"/>
  <updated>2014-07-16T11:36:33+02:00</updated>
  <id>http://Gnirt.github.io/</id>
  <author>
    <name><![CDATA[Philippe Tring]]></name>
    
  </author>
  <generator uri="http://octopress.org/">Octopress</generator>

  
  <entry>
    <title type="html"><![CDATA[Moment de danse hors du temps]]></title>
    <summary><![CDATA[]]></summary>
    <link href="http://Gnirt.github.io/blog/2014/06/15/moment-de-danse-hors-du-temps/"/>
    <updated>2014-06-15T15:46:57+02:00</updated>
    <id>http://Gnirt.github.io/blog/2014/06/15/moment-de-danse-hors-du-temps</id>
    <content type="html"><![CDATA[<div><iframe width="640" height="360" src="//www.youtube.com/embed/5PkOycQlqVE" frameborder="0" allowfullscreen></iframe></div>




<p>Il y a des fois ou on se sent inspir&eacute;, qu&#8217;une musique nous prend et voila ce que &ccedil;a donne, <strong>session danse solo improvis&eacute;e</strong> ! Ce vendredi j&rsquo;ai eu la chance de participer &agrave; une nuit &agrave; la belle &eacute;toile &eacute;v&eacute;nement organis&eacute; par Michel et Augustin. Par la m&ecirc;me occasion de rencontrer Rapha&euml;l, Octavio ( Et Ena je t&#8217;oublis pas ! ) du groupe <a href="https://www.facebook.com/musicnamaste">Namaste</a> qui m&rsquo;ont vraiment inspir&eacute; et rappel&eacute; mon voyage en Inde mais surtout fait vivre un moment de partage hors du temps. Merci &agrave; vous !</p>

]]></content>
  </entry>
  
  <entry>
    <title type="html"><![CDATA[Pourquoi j’ai choisis d’intègrer une startup]]></title>
    <summary><![CDATA[]]></summary>
    <link href="http://Gnirt.github.io/blog/2014/04/21/pourquoi-jai-choisis-dintegrer-une-startup/"/>
    <updated>2014-04-21T17:48:51+02:00</updated>
    <id>http://Gnirt.github.io/blog/2014/04/21/pourquoi-jai-choisis-dintegrer-une-startup</id>
    <content type="html"><![CDATA[<p><img class="center" src="http://Gnirt.github.io/images/startup-or-corporate.jpg"></p>

<p>Il y&#8217;a de cela 4 mois j&#8217;int&eacute;grais l&#8217;&eacute;quipe de <a href="http://chictypes.com/">Chictypes</a>, une startup dont l&#8217;aventure a commenc&eacute;e un an de cela. Laissez moi partager avec vous pourquoi je recommencerais sans h&eacute;siter.<br /><br />
<!-- more -->   
<strong>Une ouverture d&#8217;esprit</strong><br /><br />Je n&#8217;ai probablement pas besoin de vous dire que la plupart des startups ne vous payeront pas aussi bien que certaines SSII. Vous (ou votre dipl&ocirc;me) valent certainement plus que ce qu&#8217;une startup est capable de payer. Mais travailler pour une startup offre d&#8217;autres avantages, votre monter en comp&eacute;tence, votre polyvalence, vous ne serez pas cantonn&eacute; a un r&ocirc;le (ou alors il y&#8217;a un probl&egrave;me) me retrouver a r&eacute;pondre au t&eacute;l&eacute;phone, faire la maintenance du r&eacute;seau, monter une table, trouver un moyen d&#8217;&ecirc;tre &agrave; 4 sur une table suppos&eacute; en accueillir 2. Mais c&#8217;est surtout le lieu parfait pour apprendre rapidement hors de votre domaine de comp&eacute;tence. Comprendre les processus de Marketing, le Taylorisme, de recrutement etc&#8230; Et en retour quel bonheur quand la personne en marketing vous parleras de ses probl&egrave;mes HTML pour envoyer sa campagne de mail !<br /><br /><strong>Des responsabilit&eacute;s</strong><br /><br />Travailler pour une startup veut probablement dire que vous faites partie d&#8217;une petite &eacute;quipe. Il n&#8217;y a pas de meilleur endroits ou votre polyvalence sera mise &agrave; l&#8217;&eacute;preuve. Vous jouerez un r&ocirc;le primordiale, participerez a la cr&eacute;ation du produit, et verrez grandir votre b&eacute;b&eacute; de jours en jours et ressentirez une tr&egrave;s grande fiert&eacute; en regardant en arri&egrave;re.<br /><br /><strong>Votre travail sera reconnu (tout comme vos &eacute;checs !)</strong><br /><br />Lorsque l&#8217;on int&egrave;gre une grosse entreprise, il y&#8217;a des chances pour que votre sup&eacute;rieur obtienne tout les fruits de votre travail ou que votre sup&eacute;rieur ignore simplement votre travail. Mais dans un environnement aussi restreint, il est quasi impossible de ne pas reconnaitre un travail bien fait. Si vous r&eacute;ussissez votre &eacute;quipe le verra instantan&eacute;ment. Ouvrez vos bras en V mes amis, votre travail a &eacute;t&eacute; reconnu ! Mais de l&#8217;autre cot&eacute; si vous faites des erreurs tout vous retomberas dessus (Pardon d&#8217;avoir spamm&eacute; vos boites mails !). Cela pr&eacute;sente un double avantage, vous serez plus vigilant pour ne pas d&eacute;cevoir vos coll&egrave;gues. Et vous ne vous rel&acirc;cherais pas, car le reste de l&#8217;&eacute;quipe se demanderas pourquoi est-ce qu&#8217;elle travaille deux fois plus dure. Restez concentr&eacute;s et vos succ&egrave;s seront mis en valeurs et vos &eacute;checs minimis&eacute;s. Et lorsque l&#8217;on vous diras &#8220;Nous n&#8217;aurions pas pu le faire sans toi&#8221; vous pouvez &ecirc;tre sure qu&#8217;ils le pensent. Appr&eacute;cier la bi&egrave;re ou le champagne offert pour l&#8217;occasion !<br /><br /><strong>Des opportunit&eacute;s</strong><br /><br />Cela vous forcera a monter en comp&eacute;tence rapidement, mais aussi apprendre &agrave; vous organiser en fonction des priorit&eacute;s, la plupart des startups adopte une m&eacute;thode AGILE. Dans une plus grosse entreprise je n&#8217;aurais probablement pas eu les m&ecirc;me opportunit&eacute;s, savoir que tous le monde compte sur le travail que j&#8217;effectue. Suis-je le membre le plus important de l&#8217;&eacute;quipe ? D&eacute;finitivement pas. Mais suis-je une partie int&eacute;grale de celle ci ? C&#8217;est certain. C&#8217;est le meilleur endroit pour prendre en gallon.<br /><br /><strong>Un &eacute;change enrichissant</strong><br /><br />Le monde de l&#8217;entrepreunariat&#8230; Vous rencontrerez des innovateurs ! Ayant une perception totalement diff&eacute;rentes, une fa&ccedil;on de pens&eacute;e &agrave; part enti&egrave;re de r&eacute;soudre les probl&egrave;mes. Il y&#8217;a beaucoup &agrave; apprendre de ces personnes qui d&eacute;cident de cr&eacute;er quelquechose. Ce challenge permanent se transmettras &agrave; vous, ainsi que leurs persistances. Toutes les startups se forment autour d&#8217;un noyau et il y&#8217;a beaucoup a apprendre de ce noyau pour peu que l&#8217;on prenne le temps de l&#8217;observer !<br /><br /><strong>Une atmosph&egrave;re funky !</strong><br /><br />M&ecirc;me si toutes les startups ont leurs petites traditions voila ce qui est le plus r&eacute;current :<br />&nbsp;- Venez comme vous &ecirc;tes ! Aucun dresscode<br />&nbsp;- Beaucoup de rires !<br />&nbsp;- Nous sommes tous anim&eacute;s par le m&ecirc;me but, l&#8217;esprit entrepreneurial est contagieux !<br />&nbsp;- Vous pouvez boire des bi&egrave;res au travail ! Mais seulement pour les occasions sp&eacute;ciales&#8230; Je vous fais confiance pour trouver beaucoup d&rsquo;occasions sp&eacute;ciales ! Wink.</p>

]]></content>
  </entry>
  
  <entry>
    <title type="html"><![CDATA[Comment j’ai commmencer Ruby et Rails de zéro?]]></title>
    <summary><![CDATA[]]></summary>
    <link href="http://Gnirt.github.io/blog/2014/03/26/comment-jai-commmencer-ruby-et-rails-de-zero/"/>
    <updated>2014-03-26T09:48:37+01:00</updated>
    <id>http://Gnirt.github.io/blog/2014/03/26/comment-jai-commmencer-ruby-et-rails-de-zero</id>
    <content type="html"><![CDATA[<p>J&#8217;ai fais la d&eacute;couverte de Ruby a la fin d&#8217;ann&eacute;e 2013, suite aux nombreux avis de la communaut&eacute; Ruby (Rencontre &agrave; Paris.rb, diff&eacute;rents d&eacute;veloppeurs rencontr&eacute;s inopin&eacute;ment). Ayant seulement fait du d&eacute;veloppement web sur du php auparavant. J&#8217;ai voulu m&#8217;essayer &agrave; un langage de programmation orient&eacute;e objet. J&rsquo;avais donc (beaucoup?) entendu parler de Ruby, j&rsquo;ai commenc&eacute; &agrave; regarder &agrave; quoi &ccedil;a ressemblait.
<!-- more -->
<br /><br />Ressources ruby :<br /><br />J&#8217;ai commencer avec <a href="http://rubymonk.com">Ruby Monk</a> ce site permet d&rsquo;apprendre les bases de Ruby sans aucune installation sur son ordinateur sous forme de le&ccedil;on.<br /><br />Les autres ressources qui on aussi bonne r&eacute;putation :<br /><br /><a href="http://tryruby.org">Try Ruby</a><br /><a href="http://www.rubykoans.com">Ruby Koans</a><br /><a href="http://ruby.learncodethehardway.org">Learn code the hard way </a><br /><br />R&eacute;f&eacute;rence sp&eacute;cial pour <a href="https://www.bloc.io/ruby-warrior"> Ruby Warrior</a> qui permet d&#8217;apprendre le ruby sous la forme d&#8217;un jeu (en plus le design en pixel art est magnifique !)<br /><br />Ensuite rails :<br /><br />J&#8217;ai pour ma part commencer avec <a href="http://railstutorial.org/"> Rails Tutorial </a> qui vous fait coder une version basique de l&#8217;application Twitter. Au passage en plus de vous apprendre rails et il vous apprend toute la partie d&eacute;ploiement de l&#8217;application ! (Git, Heroku..)<br /><br />Mais aussi :</p>


<p><a href="http://railsforzombies.org/">Rails for Zombies</a> pour apprendre de fa&ccedil;on ludique !<br /><a href="http://guides.rubyonrails.org/"> </a> les guides officielles<br /><a href="http://railscasts.com/">Rails Casts</a> qui propose des vid&eacute;os succinctes sur des sujets en particulier</p>


<p><a href="http://rubygems.org">Ruby Gems</a> pour toutes les gems<br /><a href="https://www.ruby-toolbox.com/">Ruby Toolbox</a> pour toutes les gems<br /><br />et beaucoup de stackoverflow :)<br /><br />Pour les curieux vous pouvez voir mon application <a href="https://sheltered-everglades-2986.herokuapp.com/" target="_blank">ici</a><br /><br />Philippe</p>

]]></content>
  </entry>
  
  <entry>
    <title type="html"><![CDATA[20 conseils pour mieux réussir vos recherches sur google (Partie 2)]]></title>
    <summary><![CDATA[]]></summary>
    <link href="http://Gnirt.github.io/blog/2014/02/19/20-tips-pour-mieux-reussir-vos-recherches-sur-google-partie-2/"/>
    <updated>2014-02-19T09:32:25+01:00</updated>
    <id>http://Gnirt.github.io/blog/2014/02/19/20-tips-pour-mieux-reussir-vos-recherches-sur-google-partie-2</id>
    <content type="html"><![CDATA[<p>Aujourd&#8217;hui je partage avec vous 10 autres tips pour faire des recherches plus efficaces sur Google (ou comme j&#8217;aime l&#8217;appeler l&#8217;Oracle) ! Vous pouvez retrouver la première partie <a href="http://Gnirt.github.io/blog/2014/01/29/20-tips-pour-mieux-reussir-vos-recherches-sur-google-partie-1/">ici<br /></a></p>


<!-- more -->


<ol>
<li>Lien<br />Le symbole &#8220;link:&#8221; trouveras les pages contenant un lien vers une URL<br /><br /><em>ex : </em>link: philippetring.fr<br /><br /></li>
<li>Recherche Vertical<br />Plutot que de faire une recherche &agrave; travers tout le web, google met a notre disposition plusieurs moteurs plus sp&eacute;cifique.<br /><br />
<ul>
<li><em>http://blogsearch.google.com/</em> </li>
<li><em>http://books.google.com/</em></li>
<li><em>http://scholar.google.com/</em></li>
<li><em>http://catalogs.google.com/</em></li>
<li><em>http://www.google.com/codesearch</em></li>
<li><em>http://www.google.com/dirhp</em></li>
<li><em>http://finance.google.com/finance</em></li>
<li><em>http://images.google.com/</em></li>
<li><em>http://maps.google.com/maps</em></li>
<li><em>http://news.google.com/</em></li>
<li><em>http://www.google.com/patents</em></li>
<li><em>http://www.google.com/products</em></li>
<li><em>http://video.google.com/<br /><br /></em></li>
</ul>
</li>
<li>Films<br />&#8220;Film:&#8221; permet de lister les cin&eacute;mas les plus proches&nbsp;et les horaires si il est suivi d&#8217;un code postal, d&#8217;une ville etc..<br /><br /></li>
<li>Musique<br />Musique: pour le contenu relatif a de la musique<br /><br /></li>
<li>Conversion d&#8217;unit&eacute;<br />Unit&eacute; de distance, de monnaie<br /><br /><em>ex :</em> 12 meters in miles<br /><br /></li>
<li>Nombre particulier<br />Dates, code postaux, num&eacute;ro de t&eacute;l&eacute;phone, Google reconnait diff&eacute;rents pattern.<br /><br /></li>
<li>Type de fichier<br />&#8220;filetype:&#8221; pour lister uniquement les fichiers d&#8217;un type (pdf, word, etc..)<br /><br /></li>
<li>Recherche sur tag<br />Si vous souhaitez baser votre recherche sur le contenu html vous pouvez utiliser : &#8220;inurl:&#8221;, &#8220;intitle:&#8221;, &#8220;intext:&#8221;, and &#8220;inanchor:&#8221;<br /><br /></li>
<li>Cache<br />Cette fonctionnalit&eacute;e peu connue permet de faire une recherche sur le cache de google (donc retrouver des pages possiblement supprim&eacute;es)<br /><br /></li>
<li>Answer to life, the universe, and everything<br />L&#8217;oracle vous r&eacute;pondras.</li>
</ol>


<p>Sources : <br /><a href="http://www.googleguide.com/using_advanced_operators.html">http://www.googleguide.com/using_advanced_operators.html<br /></a><a href="http://sudarmuthu.com/blog/google-search-syntax-dissected">http://sudarmuthu.com/blog/google-search-syntax-dissected</a></p>

]]></content>
  </entry>
  
  <entry>
    <title type="html"><![CDATA[20 tips pour mieux réussir vos recherches sur google (Partie 1)]]></title>
    <summary><![CDATA[]]></summary>
    <link href="http://Gnirt.github.io/blog/2014/01/29/20-tips-pour-mieux-reussir-vos-recherches-sur-google-partie-1/"/>
    <updated>2014-01-29T10:37:01+01:00</updated>
    <id>http://Gnirt.github.io/blog/2014/01/29/20-tips-pour-mieux-reussir-vos-recherches-sur-google-partie-1</id>
    <content type="html"><![CDATA[<p>Aujourd’hui je partage avec vous 10 tips pour faire des recherches plus efficaces sur Google (ou comme j’aime l’appeler l’Oracle) !</p>

<!-- more -->


<ol>
<li><p>OU (OR)
Google fait normalement une recherche sur l’ensemble des mots clés que vous lui fournissez. Néanmoins en utilisant le symbole “|” ( Pipe ) il est possible de demander a faire une recherche sur un mot ou un autre voir les deux.</p>

<p>  ex : blog | philippe | tring</p></li>
<li><p>Guillemets
Si vous recherchez une phrase exact, utilisez des guillemets.</p>

<p>  ex : “blog philippe tring” ou blog “philippe tring” rechercheras le mot blog ainsi que la suite de mots “philippe tring”</p></li>
<li><p>NON (NOT)
Si vous souhaitez que google ne prenne pas en compte les pages ayant certains mots, précédais les d’un tiret “-“</p>

<p>  ex : -blog philippe tring</p></li>
<li><p>Mots similaires
En utilisant le tilde “~” vous ferez une recherche sur des mots ayant la même signification.</p>

<p>  ex : ~bonheur philippe tring</p></li>
<li><p>Wildcard
Le symbole “*” fait office de joker. Il remplace n’importe quel mots très utile si vous recherchez les paroles d’une chanson.</p>

<p>  ex : “We all live in a * submarine” vous retournera les paroles de la chanson des Beatles</p></li>
<li><p>Definition
Pour avoir une définition d’un mot précédais le de “definition:” ou “define:”</p>

<p>  ex : define:bonheur</p></li>
<li><p>Google recherche avancée
Si vous n’arrivez pas a vous rappeler de tout ses mots vous pouvez utiliser l’outil de recherche avancée de google <a href="http://www.google.com/advanced_search">http://www.google.com/advanced_search</a></p></li>
<li><p>Calculatrice
Vous pouvez vous servir de google comme d’une calculatrice</p></li>
<li><p>Intervalle de nombre
Cette fonctionnalitée peu connue permet de faire une recherche sur un intervalle de nombre</p>

<p>  ex : 1992..2014 nobel</p></li>
<li><p>Site spécifique
Pour concentrer votre recherche sur un site unique utilisez le mot “site:”</p>

<p>  ex : site:philippetring.fr blog</p></li>
</ol>


<p>Sources :</p>

<ul>
<li><a href="http://www.googleguide.com/using_advanced_operators.html">http://www.googleguide.com/using_advanced_operators.html</a></li>
<li><a href="http://sudarmuthu.com/blog/google-search-syntax-dissected">http://sudarmuthu.com/blog/google-search-syntax-dissected</a></li>
</ul>


<p>Pour la seconde partie c&#8217;est par <a href="http://Gnirt.github.io/blog/2014/02/19/20-tips-pour-mieux-reussir-vos-recherches-sur-google-partie-2/">ici</a></p>
]]></content>
  </entry>
  
  <entry>
    <title type="html"><![CDATA[Hacker le processus de recrutement]]></title>
    <summary><![CDATA[]]></summary>
    <link href="http://Gnirt.github.io/blog/2014/01/10/hacker-le-processus-de-recrutement/"/>
    <updated>2014-01-10T20:29:20+01:00</updated>
    <id>http://Gnirt.github.io/blog/2014/01/10/hacker-le-processus-de-recrutement</id>
    <content type="html"><![CDATA[<p>Plein d’entrain et d’espoir vous avez envoyé 1001 lettres de motivations et CV. Mais aucune ne vous a répondu, car vous n’avez <strong>aucune expérience</strong> professionnelle dans le domaine.</p>

<!-- more -->


<p>Dans un contexte ou les entreprises sont de plus en plus sollicitées, par mails, téléphone, lettres de motivations plus géniales les unes que les autres (ou pas..), comment se <strong>démarquer des autres</strong> ? Le moyen le plus simple de rentrer dans une entreprise est de connaitre une personne déjà présente dans l’entreprise. (Cf : <a href="http://fr.wikipedia.org/wiki/Piston" title="Lien wikipédia">Piston</a>, avantage obtenu grâce à l’appui de certaines relations dans une entreprise ou administration.). Et si demain la personne pistonnée c’était vous ?</p>

<p>Avant de débuter cet article il est important de rappeler la notion d’opportunité. Une opportunité est une occasion favorable. Dans notre cas favorable à la recherche d’entreprise et plus précisément la rencontre d’une relation pouvant nous amener à trouver notre entreprise. Alors, comment rencontrer notre Messie ?</p>

<p>Le networking, mais c’est quoi ? Beaucoup utilisé dans le monde de l’entrepreneuriat ce terme signifie simplement le fait d’agrandir son réseau.</p>

<p>Nous savons qui nous voulons rencontrer, mais où le faire ? Je précise que j’habite en région parisienne. Il y a donc tous les jours (Il suffit de chercher un peu) des conférences, meetup, rencontres organisées à propos de technologies, ou de façon informelle dans des cafés.</p>

<p>L’intérêt en plus de rencontrer de potentielles relations est de partager avec des inconnus son expérience, on y fait plein de rencontres plus intéressantes les unes que les autres ! En plus d’enrichir ses connaissances !</p>

<p>Vous voila seul entouré de plein d’inconnus, comment entamer la conversation ? Je vous révèle ma phrase magique : « Bonjour (Sourire, en regardant la personne dans les yeux), c’est la première fois que tu viens à un événement pareil ? »</p>

<p>Ensuite, à vous de jouer, car je le rappel, le meilleur moyen d’avoir des opportunités dans la vie, c’est d’en être une soi-même.</p>

<p>Bonne année 2014, en vous souhaitant pleins de jolies rencontres, Philippe.</p>

<p>Bonus, une liste non exhaustive de sites qui organisent ces meetings (N’hésitez pas à m’envoyer vos sites <a href="&#109;&#x61;&#x69;&#108;&#116;&#111;&#x3a;&#x70;&#x68;&#105;&#x6c;&#105;&#112;&#x70;&#101;&#116;&#114;&#x69;&#110;&#103;&#x40;&#x67;&#109;&#x61;&#105;&#108;&#46;&#x63;&#111;&#109;">&#x70;&#104;&#x69;&#108;&#x69;&#x70;&#112;&#101;&#x74;&#x72;&#105;&#110;&#x67;&#64;&#103;&#109;&#x61;&#105;&#x6c;&#x2e;&#x63;&#x6f;&#109;</a>)</p>

<ul>
<li><a href="http://www.meetup.com/">http://www.meetup.com/</a></li>
<li><a href="https://www.startupdigest.com/">https://www.startupdigest.com/</a></li>
</ul>

]]></content>
  </entry>
  
</feed>
