<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">

  <title><![CDATA[Category: Life | Tring Philippe Blog]]></title>
  <link href="http://philippetring.fr/blog/categories/life/atom.xml" rel="self"/>
  <link href="http://philippetring.fr/"/>
  <updated>2016-04-04T19:09:36+02:00</updated>
  <id>http://philippetring.fr/</id>
  <author>
    <name><![CDATA[Philippe Tring]]></name>
    
  </author>
  <generator uri="http://octopress.org/">Octopress</generator>

  
  <entry>
    <title type="html"><![CDATA[Utiliser Un Ballon De Fitness Comme Chaise De Bureau ?]]></title>
    <link href="http://philippetring.fr/blog/2015/02/18/utiliser-un-ballon-de-fitness-comme-chaise-de-bureau/"/>
    <updated>2015-02-18T07:36:19+01:00</updated>
    <id>http://philippetring.fr/blog/2015/02/18/utiliser-un-ballon-de-fitness-comme-chaise-de-bureau</id>
    <content type="html"><![CDATA[<p><img class="center" src="/images/ball-chair-main-2.jpg"></p>

<p>S'asseoir sur une chaise toute la journée est vraiment mauvais. Qu'en est-il de s'asseoir sur un ballon d'exercice ?</p>

<p>Il y a quelques mois de cela, j'ai remplacé ma chaise de bureau chez <a href="http://easi-crm.com">easiware</a> pour un ballon de fitness. Passant un certain nombre d'heures à mon bureau je me demandais si cela aurait un impact positif sur ma position mais surtout&hellip; J'aime essayer des choses nouvelles !</p>

<!-- more -->


<h1>Santé</h1>

<p>Je ne vais pas vous faire un article sur les bienfaits potentiels d'un ballon d'exercice pour le corps. Vous trouverez de multiples ressources à ce sujet qui n'ont a priori aucune preuve scientifique. Après 2 mois d'essai, ma constatation est qu'un ballon de yoga est équivalent à une chaise classique (Asseyez vous 8 heures devant un écran tous les jours sans bouger, peu importe ce sur quoi vous reposez vous aurez mal !). L'important étant d'avoir une bonne position en étant assis et de régulièrement bouger !</p>

<p>J'avais aussi tendance à m'avachir vers l'arrière sur une chaise classique (Vous savez comme une larve !). Mais ne disposant pas de dossier cela m'est dorénavant impossible. Par contre pour le fait de me pencher en avant, ça ne résout absolument rien ! Donc pas de solution miracle. Simplement me rappeler de me redresser lorsque cela m'arrive.</p>

<h1>Avantages</h1>

<p>Néanmoins plusieurs choses sont agréables :</p>

<ul>
<li>Le fait de pouvoir jump en écoutant une musique entrainante en plein milieu de l'open-space</li>
<li>Faire le pont (Etirer son dos par la même occasion) pour réfléchir&hellip; ou pas ! Bonus, un animal snappé dans son état naturel. (Clic sur l'image)<br>
<a href="/images/ball-chair-snapchat.jpg" class="fancybox" title="snap by Tobi "><img src="/images/ball-chair-snapchat-thumb.jpg" alt="snap by Tobi " /></a></li>
<li>Tenter de rester aussi longtemps que possible en équilibre en décollant les pieds du sol.</li>
<li>Pour la gente féminine la possibilité de se frotter l'entrejambe serait plausible d'après une testeuse souhaitant garder l'anonymat. (Faites juste attention aux regards de vos collègues !)</li>
</ul>


<h1>Inconvénients</h1>

<ul>
<li>Pour la gente masculine, vos bijoux familiaux risquent parfois d’être mal placés ! Pas de panique un simple réajustement sera aisé à faire.</li>
<li>Le bruit de votre pantalon contre le ballon qui ressemble étrangement à un pet.</li>
<li>Attention si vous tentez l’aventure vos collègues pourraient avoir tendance à vous déséquilibrer aux moments les plus inattendus !</li>
</ul>


<p>Donc pas de solution miracle pour votre position ! Mais il est vrai que je trouve l’expérience agréable et que je me vois mal retourner à une chaise classique.</p>

<p>Bonne année de la chèvre !</p>
]]></content>
  </entry>
  
  <entry>
    <title type="html"><![CDATA[Poéme]]></title>
    <link href="http://philippetring.fr/blog/2015/01/01/poeme/"/>
    <updated>2015-01-01T18:30:53+01:00</updated>
    <id>http://philippetring.fr/blog/2015/01/01/poeme</id>
    <content type="html"><![CDATA[<p>Bonjour, comment allez-vous?</p>

<p>J'ai débuté cette année en faisant quelquechose que je n'avais pas fait depuis&hellip; Des années.</p>

<p><strong>Ecrire un poéme</strong></p>

<p>Malgrès mon inexpérience, j'éspere qu'il vous plaira. Bonne année 2015 !</p>

<!-- more -->


<blockquote><p>Je débute cette année,</p>

<p>En me réveillant, m'éveillant</p>

<p>A la vérité de la vie</p>

<p>Ma vie</p>

<p>Qui je suis</p>

<p>Qui je ne suis pas</p>

<p>Qui je souhaite être</p></blockquote>

<br><br>


<blockquote><p>Je débute cette année,</p>

<p>Enveloppé d'énergie</p>

<p>Entouré d'amis</p>

<p>Protégé par ma famille</p>

<p>Prêt a m’immerger</p></blockquote>

<br><br>


<blockquote><p>Je débute cette année,</p>

<p>Avançant face à l'inconnu</p>

<p>Sans peur</p>

<p>Bras ouvert</p>

<p>T’invitant Toi</p>

<p>A me rejoindre</p>

<p>Sur ce chemin</p>

<p>De tous les possibles</p></blockquote>

<br><br>


<blockquote><p>Je débute cette année,</p>

<p>Curieux</p>

<p>Plein d'espoirs</p>

<p>Souriant</p>

<p>Vivant</p>

<p>Reconnaissant</p>

<p>De débuter cette année.</p></blockquote>

<br><br>


<blockquote><p>Philippe TRING</p></blockquote>
]]></content>
  </entry>
  
  <entry>
    <title type="html"><![CDATA[Moment De Danse Hors Du Temps]]></title>
    <link href="http://philippetring.fr/blog/2014/06/15/moment-de-danse-hors-du-temps/"/>
    <updated>2014-06-15T15:46:57+02:00</updated>
    <id>http://philippetring.fr/blog/2014/06/15/moment-de-danse-hors-du-temps</id>
    <content type="html"><![CDATA[<div class="iframe-responsive-wrapper">
    <img class="iframe-ratio" src="data:image/gif;base64,R0lGODlhEAAJAIAAAP///wAAACH5BAEAAAAALAAAAAAQAAkAAAIKhI+py+0Po5yUFQA7"/>
    <iframe src="//www.youtube.com/embed/5PkOycQlqVE" width="640" height="360" frameborder="0" webkitAllowFullScreen mozallowfullscreen allowFullScreen></iframe>
</div>




<p>Il y a des fois ou on se sent inspir&eacute;, qu'une musique nous prend et voila ce que &ccedil;a donne, <strong>session danse solo improvis&eacute;e</strong> ! Ce vendredi j&rsquo;ai eu la chance de participer &agrave; une nuit &agrave; la belle &eacute;toile &eacute;v&eacute;nement organis&eacute; par Michel et Augustin. Par la m&ecirc;me occasion de rencontrer Rapha&euml;l, Octavio ( Et Ena je t'oublis pas ! ) du groupe <a href="https://www.facebook.com/musicnamaste">Namaste</a> qui m&rsquo;ont vraiment inspir&eacute; et rappel&eacute; mon voyage en Inde mais surtout fait vivre un moment de partage hors du temps. Merci &agrave; vous !</p>

]]></content>
  </entry>
  
  <entry>
    <title type="html"><![CDATA[Pourquoi J’ai Choisi D’intègrer Une Startup]]></title>
    <link href="http://philippetring.fr/blog/2014/04/21/pourquoi-jai-choisi-dintegrer-une-startup/"/>
    <updated>2014-04-21T17:48:51+02:00</updated>
    <id>http://philippetring.fr/blog/2014/04/21/pourquoi-jai-choisi-dintegrer-une-startup</id>
    <content type="html"><![CDATA[<p><img class="center" src="http://philippetring.fr/images/startup-or-corporate.jpg"></p>

<p>Il y'a de cela 4 mois j'int&eacute;grais l'&eacute;quipe de <a href="http://chictypes.com/">Chictypes</a>, une startup dont l'aventure a commenc&eacute;e un an de cela. Laissez moi partager avec vous pourquoi je recommencerais sans h&eacute;siter.<br /><br />
<!-- more -->   
<strong>Une ouverture d'esprit</strong><br /><br />Je n'ai probablement pas besoin de vous dire que la plupart des startups ne vous payeront pas aussi bien que certaines SSII. Vous (ou votre dipl&ocirc;me) valent certainement plus que ce qu'une startup est capable de payer. Mais travailler pour une startup offre d'autres avantages, votre monter en comp&eacute;tence, votre polyvalence, vous ne serez pas cantonn&eacute; a un r&ocirc;le (ou alors il y'a un probl&egrave;me) me retrouver a r&eacute;pondre au t&eacute;l&eacute;phone, faire la maintenance du r&eacute;seau, monter une table, trouver un moyen d'&ecirc;tre &agrave; 4 sur une table suppos&eacute; en accueillir 2. Mais c'est surtout le lieu parfait pour apprendre rapidement hors de votre domaine de comp&eacute;tence. Comprendre les processus de Marketing, le Taylorisme, de recrutement etc... Et en retour quel bonheur quand la personne en marketing vous parleras de ses probl&egrave;mes HTML pour envoyer sa campagne de mail !<br /><br /><strong>Des responsabilit&eacute;s</strong><br /><br />Travailler pour une startup veut probablement dire que vous faites partie d'une petite &eacute;quipe. Il n'y a pas de meilleur endroits ou votre polyvalence sera mise &agrave; l'&eacute;preuve. Vous jouerez un r&ocirc;le primordiale, participerez a la cr&eacute;ation du produit, et verrez grandir votre b&eacute;b&eacute; de jours en jours et ressentirez une tr&egrave;s grande fiert&eacute; en regardant en arri&egrave;re.<br /><br /><strong>Votre travail sera reconnu (tout comme vos &eacute;checs !)</strong><br /><br />Lorsque l'on int&egrave;gre une grosse entreprise, il y'a des chances pour que votre sup&eacute;rieur obtienne tout les fruits de votre travail ou que votre sup&eacute;rieur ignore simplement votre travail. Mais dans un environnement aussi restreint, il est quasi impossible de ne pas reconnaitre un travail bien fait. Si vous r&eacute;ussissez votre &eacute;quipe le verra instantan&eacute;ment. Ouvrez vos bras en V mes amis, votre travail a &eacute;t&eacute; reconnu ! Mais de l'autre cot&eacute; si vous faites des erreurs tout vous retomberas dessus (Pardon d'avoir spamm&eacute; vos boites mails !). Cela pr&eacute;sente un double avantage, vous serez plus vigilant pour ne pas d&eacute;cevoir vos coll&egrave;gues. Et vous ne vous rel&acirc;cherais pas, car le reste de l'&eacute;quipe se demanderas pourquoi est-ce qu'elle travaille deux fois plus dure. Restez concentr&eacute;s et vos succ&egrave;s seront mis en valeurs et vos &eacute;checs minimis&eacute;s. Et lorsque l'on vous diras "Nous n'aurions pas pu le faire sans toi" vous pouvez &ecirc;tre sure qu'ils le pensent. Appr&eacute;cier la bi&egrave;re ou le champagne offert pour l'occasion !<br /><br /><strong>Des opportunit&eacute;s</strong><br /><br />Cela vous forcera a monter en comp&eacute;tence rapidement, mais aussi apprendre &agrave; vous organiser en fonction des priorit&eacute;s, la plupart des startups adopte une m&eacute;thode AGILE. Dans une plus grosse entreprise je n'aurais probablement pas eu les m&ecirc;me opportunit&eacute;s, savoir que tous le monde compte sur le travail que j'effectue. Suis-je le membre le plus important de l'&eacute;quipe ? D&eacute;finitivement pas. Mais suis-je une partie int&eacute;grale de celle ci ? C'est certain. C'est le meilleur endroit pour prendre en gallon.<br /><br /><strong>Un &eacute;change enrichissant</strong><br /><br />Le monde de l'entrepreunariat... Vous rencontrerez des innovateurs ! Ayant une perception totalement diff&eacute;rentes, une fa&ccedil;on de pens&eacute;e &agrave; part enti&egrave;re de r&eacute;soudre les probl&egrave;mes. Il y'a beaucoup &agrave; apprendre de ces personnes qui d&eacute;cident de cr&eacute;er quelquechose. Ce challenge permanent se transmettras &agrave; vous, ainsi que leurs persistances. Toutes les startups se forment autour d'un noyau et il y'a beaucoup a apprendre de ce noyau pour peu que l'on prenne le temps de l'observer !<br /><br /><strong>Une atmosph&egrave;re funky !</strong><br /><br />M&ecirc;me si toutes les startups ont leurs petites traditions voila ce qui est le plus r&eacute;current :<br />&nbsp;- Venez comme vous &ecirc;tes ! Aucun dresscode<br />&nbsp;- Beaucoup de rires !<br />&nbsp;- Nous sommes tous anim&eacute;s par le m&ecirc;me but, l'esprit entrepreneurial est contagieux !<br />&nbsp;- Vous pouvez boire des bi&egrave;res au travail ! Mais seulement pour les occasions sp&eacute;ciales... Je vous fais confiance pour trouver beaucoup d&rsquo;occasions sp&eacute;ciales ! Wink.</p>

]]></content>
  </entry>
  
</feed>
